<template>
	<div class="page-top">
		<BasePageTop
			:data="pageTopData"
			:modifier-classes="['personal-data-page']"
		/>
	</div>
	<div class="content">
		<div class="container">
			<p>
				В соответствии с ч. 1 ст. 9 Федерального закона от 27.07.2006 №
				152-ФЗ «О персональных данных (далее – Закон), подтверждаю свое
				согласие на обработку и использование, передачу ООО «МедиаНация»
				(ИНН 7736602705), в том числе в автоматизированном режиме, моих
				персональных данных, а именно:
			</p>
			<ul>
				<li>
					фамилия, имя, отчество, номера контактных телефонов; адреса
					электронной̆почты; место работы и занимаемая должность, дата,
					место рождения, паспортные данные;
				</li>
				<li>
					пользовательские данные (сведения о местоположении; тип и
					версия ОС; тип и версия Браузера;
				</li>
				<li>тип устройства и разрешение его экрана;</li>
				<li>источник откуда пришел на сайт пользователь;</li>
				<li>с какого сайта или по какой рекламе;</li>
				<li>язык ОС и Браузера;</li>
				<li>
					какие страницы открывает и на какие кнопки нажимает
					пользователь;
				</li>
				<li>ip-адрес.</li>
			</ul>
			<p>
				2. Настоящим соглашаюсь с тем, что перечисленные персональные
				данные будут использованы для следующих целей:
			</p>
			<ul>
				<li>
					сбор и обработка входящих запросов физических лиц с целью
					оказания консультирования;
				</li>
				<li>
					аналитики действий физического лица на веб-сайте и
					функционирования веб-сайта;
				</li>
				<li>
					проведение рекламных и новостных рассылок по указанным
					телефонам и контактам, в том числе в автоматизированном
					режиме.
				</li>
			</ul>
			<p>
				3. Соглашаюсь с тем, что в ходе обработки с моими персональными
				данными ООО «МедиаНация» будут совершены следующие действия:
				сбор; запись; систематизация; накопление; хранение; уточнение
				(обновление, изменение); извлечение; использование; передача
				(распространение, предоставление, доступ неограниченному кругу
				лиц); блокирование; удаление; уничтожение.
			</p>
			<p>
				4. Персональные данные обрабатываются до моей отписки от
				рекламных и новостных рассылок. Также обработка персональных
				данных может быть прекращена по соответствующему письменному
				запросу
			</p>
			<p>
				5. Подтверждаю, что настоящее согласие действует все время до
				момента прекращения обработки персональных данных в порядке,
				установленном в п.4 Согласия.
			</p>
		</div>
	</div>
</template>

<script setup lang="ts">
	import { useMetaStore } from '@/stores/meta';
	import BasePageTop from '@/components/base-page-top';

	const pageTopData = {
		title: 'СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ КЛИЕНТОВ',
		breadcrumbs: [
			{
				id: 1,
				name: 'Главная',
				link: '/',
			},
			{
				id: 2,
				name: 'Персональные данные',
				link: null,
			},
		],
	};

	const { setMeta } = useMetaStore();

	setMeta({
		title: 'Политика конфиденциальности',
		description:
			'На данной странице находится информация о политике конфиденциальности',
		og: {
			title: 'Политика конфиденциальности',
			description:
				'На данной странице находится информация о политике конфиденциальности',
			image: 'https://medianation.ru/storage/static/og_default.png',
			type: 'website',
			url: 'https://medianation.ru/personal-data/',
		},
		noindex: false,
	});
</script>

<style scoped lang="scss">
	.page-top {
		margin-bottom: 50px;
	}

	.content {
		font-size: 20px;
		line-height: 1.7;
		margin-bottom: 100px;

		p {
			margin: 40px 0 20px;

			&:first-child {
				margin-top: 0;
			}
		}

		ul {
			margin: 0;
			padding: 0 0 0 40px;
		}

		li {
			&:not(:last-child) {
				margin-bottom: 12px;
			}
		}
	}

	@include md {
		.page-top {
			margin-bottom: 40px;
		}
	}

	@include sm {
		.page-top {
			margin-bottom: 20px;
		}

		.content {
			font-size: 18px;
			margin-bottom: 60px;

			p {
				margin: 30px 0 15px;
			}

			ul {
				padding-left: 25px;
			}
		}
	}
</style>
